so ~/.vim/rc/plugins.vim " Подключение расширений
so ~/.vim/rc/color.vim   " Настройка цветов

                         " Мышка
se mouse  =a
se mousem =popup

se nu                    " Нумеровать строки
se nuw    =5             " Ширина поля нумерации строк

se so     =2             " Количество строк сверху и снизу при прокрутке

se sw     =4             "

se et                    " Табуляция -> пробелы
se tw     =80

se ar                    " Перечитывать измененные файлы автоматически
se ls     =2             " Всегда показывать строку состояния
se enc    =utf-8         " Кодировка

                         " Поиск
se ic                    " Не учитывать регистр
se hls                   " Подсветка результатов
se is                    " Поиск во время набора
se scs                   " Учитывать регистр, если введены сиволы в
                         " верхнем регистре

se sc                    " Отображать команды

se sm                    " Показывать первую парную скобку после ввода второй

se hid                   " Отключения сохранения буфера

se hi     =250           " записей в истории

se bdir   =~/.vim/tmp
se dir    =~/.vim/tmp
se vdir   =~/.vim/tmp

so ~/.vim/rc/keymap.vim  " Подключение переопредений клавиатуры

